# Есть 3 задачи. Попробуйте реализовать как можно больше
# и использовать при реализации как можно больше из тем курса.
#
# 1) Есть 2 типа фигур:
# - прямоугольный треугольник
# - прямоугольник
#
# Придумайте, как задавать эти фигуры (с помощью какого типа данных).

# Напишите функцию, которая:
# - принимает на вход 2 фигуры.
# - проверяет, пересекаются они или нет.



# 2) Дополните код программы к задаче 1 возможностью
# принимать на вход любое количество фигур.



# 3) Когда-то в каком-то фильме мы видели экран
# с зелеными буквами, быстро мелькающими.

# Придумайте и реализуйте свой механизм мелькания случайных букв на экране с
# учетом пожеланий:
#
# - цвет и оттенки не важны, в некоторых местах просто пробелы.
# - массив букв поднимается вверх, как в фильме, с "похожей" скоростью.
# * по мере появления новых букв накапливайте буквы для слова Python.
# Как только накопилось, добавляйте счетчик питонов и накапливайте снова.
# А где-то рядом отображайте текущее количество питонов.